openfoam/cylinder/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;


boundaryField
{    
    INLET
    {
        type            calculated;
        value           uniform 0;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    CIR
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(FRONT|BACK)"
    {
        type            empty;
    }

    "(UP|DOWN)"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
