openfoam/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    INLET
    {
        type            patch;
        nFaces          113;
        startFace       70120;
    }
    OUTLET
    {
        type            patch;
        nFaces          113;
        startFace       70233;
    }
    FRONT
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          35304;
        startFace       70346;
    }
    BACK
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          35304;
        startFace       105650;
    }
    UP
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          247;
        startFace       140954;
    }
    DOWN
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          247;
        startFace       141201;
    }
    CIR
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          256;
        startFace       141448;
    }
)

// ************************************************************************* //
